# Data Manipulation

In [1]:
import pandas as pd

In [2]:
data = {'name':['alice','bob','charlie'], 'age': [25,30,35]}
df = pd.DataFrame(data)

In [3]:
df.head() # To see top 5 values in dataframe/table

      name  age
0    alice   25
1      bob   30
2  charlie   35

### Indexing method

In [4]:
df.at[0, 'age'] = 26 # Update/replace the data of 0th cell of age from 25 to 26
df.head()

      name  age
0    alice   26
1      bob   30
2  charlie   35

In [5]:
df.loc[0, 'age'] = 56
df.head()

      name  age
0    alice   56
1      bob   30
2  charlie   35

In [6]:
df.columns

Index(['name', 'age'], dtype='object')

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

In [9]:
df.iloc[0,1] = 36
df.head()

      name  age
0    alice   36
1      bob   30
2  charlie   35

In [10]:
df['height'] = [165,180,175]
df.head()

      name  age  height
0    alice   36     165
1      bob   30     180
2  charlie   35     175

In [13]:
df.age
#df['age'] are both same

0    36
1    30
2    35
Name: age, dtype: int64

In [16]:
df['test'] = [2,3,'' ]
df.head()

      name  age  height test
0    alice   36     165    2
1      bob   30     180    3
2  charlie   35     175

In [18]:
df.isna() # It still gives false for null value as it is a empty string value

    name    age  height   test
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [19]:
df['test'] = [1,2,3,4] #Length of values (4) does not match length of index (3)
df.head()

ValueError: Length of values (4) does not match length of index (3)

In [20]:
import numpy as np

In [21]:
df['test'] = [2,np.nan,3]
df.head()

      name  age  height  test
0    alice   36     165   2.0
1      bob   30     180   NaN
2  charlie   35     175   3.0

In [24]:
df.isna() # It returns True Coz we defined the null value using numpy 'np.nan'

    name    age  height   test
0  False  False   False  False
1  False  False   False   True
2  False  False   False  False

In [27]:
df['gender'] = 'Male' # ''' this doesnt give erorr as above bcoz in above we used list that 
# maps all element but here we pass string and it broadcast the 'Male' to whole column'''
df.head()

      name  age  height  test gender
0    alice   36     165   2.0   Male
1      bob   30     180   NaN   Male
2  charlie   35     175   3.0   Male

In [28]:
df.loc[3] = ['Eve',29,170,3,'Female']
df.loc[4] = ['Rob',50,180,3,'Male']
df.head()

      name  age  height  test  gender
0    alice   36     165   2.0    Male
1      bob   30     180   NaN    Male
2  charlie   35     175   3.0    Male
3      Eve   29     170   3.0  Female
4      Rob   50     180   3.0    Male

In [29]:
df.isna()

    name    age  height   test  gender
0  False  False   False  False   False
1  False  False   False   True   False
2  False  False   False  False   False
3  False  False   False  False   False
4  False  False   False  False   False

In [31]:
df.isna().sum() #this gives count of how many null value is there in our dataframe

name      0
age       0
height    0
test      1
gender    0
dtype: int64